camerongillingham93/night-light/software/Microchip.ATtiny_DFP.3.2.268/edc/ATtiny1627.PIC
      </edc:ConfigFuseSector>
      <edc:UserIDSector edc:regionid="USER_SIGNATURES" edc:beginaddr="0x1300" edc:endaddr="0x1320" edc:magicoffset="0x850000" atdf:pagesize="0x20" edc:rw="rw">
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW0" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1300"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW1" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1301"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW2" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1302"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW3" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1303"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW4" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1304"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW5" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1305"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW6" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1306"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW7" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1307"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW8" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1308"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW9" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1309"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW10" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x130A"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW11" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x130B"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW12" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x130C"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW13" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x130D"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW14" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x130E"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW15" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x130F"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW16" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1310"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW17" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1311"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW18" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1312"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW19" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1313"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW20" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1314"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW21" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1315"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW22" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1316"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW23" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1317"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW24" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1318"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW25" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1319"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW26" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x131A"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW27" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x131B"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW28" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x131C"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW29" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x131D"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW30" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x131E"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW31" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x131F"/>
      </edc:UserIDSector>
      <edc:EEDataSector edc:regionid="EEPROM" edc:beginaddr="0x811400" edc:endaddr="0x811500" edc:magicoffset="0x810000" atdf:pagesize="0x20" edc:rw="rw"/>
      <edc:GPRDataSector edc:regionid="INTERNAL_SRAM" edc:beginaddr="0x3800" edc:endaddr="0x4000" edc:isexecutable="false" edc:rw="rw"/>
      <edc:GPRDataSector edc:regionid="MAPPED_PROGMEM" edc:beginaddr="0x8000" edc:endaddr="0xC000" atdf:pagesize="0x40" edc:isexecutable="false" edc:rw="rw"/>
    </edc:RegardlessOfMode>
    <edc:RegisterMap edc:id="TCA0/SINGLE">
      <edc:SFRDef ltx:memberofperipheral="TCA0" edc:cname="CTRLA" edc:nzwidth="0x8" edc:access="n---nnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x8F" edc:addr="0xA00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Module Enable"/>
            <edc:SFRFieldDef edc:cname="CLKSEL" edc:nzwidth="0x3" edc:desc="Clock Selection">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="System Clock" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="System Clock / 2" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="System Clock / 4" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="System Clock / 8" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="System Clock / 16" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="System Clock / 64" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="System Clock / 256" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="DIV1024" edc:desc="System Clock / 1024" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
